miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
/*
 * sysctl_tm4c.h
 *
 *  Created on: Aug 22, 2014
 *      Author: miro
 */

#ifndef SYSCTL_TM4C_H_
#define SYSCTL_TM4C_H_


#include <mcu_inc.h>
#include <tmos_types.h>

/*******************************************************************************
 *  System Control  (offset 0x400F.E000)
 ******************************************************************************/
struct SYSCTL_TypeDef
{
  __IO uint32_t SYSCTL_DID0;		//!< (sysctl:0x000) Device Identification 0
  __IO uint32_t SYSCTL_DID1; 		//!< (sysctl:0x004) RO - Device Identification 1
  __IO uint32_t reserved1[12];		//!< (sysctl:0x008)
  __IO uint32_t SYSCTL_PTBOCTL; 	//!< (sysctl:0x038) Power-Temp Brown Out Control
  __IO uint32_t reserved2[5];		//!< (sysctl:0x03C)
  __IO uint32_t SYSCTL_RIS; 		//!< (sysctl:0x050) Raw Interrupt Status
  __IO uint32_t SYSCTL_IMC; 		//!< (sysctl:0x054) Interrupt Mask Control
  __IO uint32_t SYSCTL_MISC;		//!< (sysctl:0x058) Masked Interrupt Status and Clear
  __IO uint32_t SYSCTL_RESC;		//!< (sysctl:0x05C) Reset Cause
  __IO uint32_t SYSCTL_PWRTC;		//!< (sysctl:0x060) Power-Temperature Cause
  __IO uint32_t SYSCTL_NMIC;		//!< (sysctl:0x064) NMI Cause Register
  __IO uint32_t reserved3[5];		//!< (sysctl:0x068)
  __IO uint32_t SYSCTL_MOSCCTL;		//!< (sysctl:0x07C) Main Oscillator Control
  __IO uint32_t reserved4[12];		//!< (sysctl:0x080)
  __IO uint32_t SYSCTL_RSCLKCFG; 	//!< (sysctl:0x0B0) Run and Sleep Mode Configuration Register
  __IO uint32_t reserved5[3];		//!< (sysctl:0x0B4)
  __IO uint32_t SYSCTL_MEMTIM0;		//!< (sysctl:0x0C0) Memory Timing Parameter Register 0 for Main Flash and  EEPROM
  __IO uint32_t reserved6[1];		//!< (sysctl:0x0C4)
  __IO uint32_t SYSCTL_DSMEMTIM0;	//!< (sysctl:0x0C8) Deep Sleep Mode Memory Timing Register 0 for Main Flash and EEPROM
  __IO uint32_t reserved7[27];		//!< (sysctl:0x0CC)
  __IO uint32_t SYSCTL_ALTCLKCFG; 	//!< (sysctl:0x138) Alternate Clock Configuration
  __IO uint32_t reserved8[2];		//!< (sysctl:0x13C)
  __IO uint32_t SYSCTL_DSCLKCFG; 	//!< (sysctl:0x144) Deep Sleep Clock Configuration Register
  __IO uint32_t SYSCTL_DIVSCLK;		//!< (sysctl:0x148) Divisor and Source Clock Configuration
  __IO uint32_t SYSCTL_SYSPROP;		//!< (sysctl:0x14C) System Properties
  __IO uint32_t SYSCTL_PIOSCCAL;	//!< (sysctl:0x150) Precision Internal Oscillator Calibration
  __IO uint32_t SYSCTL_PIOSCSTAT;	//!< (sysctl:0x154) Precision Internal Oscillator Statistics
  __IO uint32_t reserved9[2];		//!< (sysctl:0x158)
  __IO uint32_t SYSCTL_PLLFREQ0;	//!< (sysctl:0x160) PLL Frequency 0
  __IO uint32_t SYSCTL_PLLFREQ1;	//!< (sysctl:0x164) PLL Frequency 1
  __IO uint32_t SYSCTL_PLLSTAT;		//!< (sysctl:0x168) PLL Status
  __IO uint32_t reserved10[7];		//!< (sysctl:0x16C)
  __IO uint32_t SYSCTL_SLPPWRCFG;	//!< (sysctl:0x188) Sleep Power Configuration
  __IO uint32_t SYSCTL_DSLPPWRCFG; 	//!< (sysctl:0x18C) Deep-Sleep Power Configuration
  __IO uint32_t reserved11[4];		//!< (sysctl:0x190)
  __IO uint32_t SYSCTL_NVMSTAT;		//!< (sysctl:0x1A0) Non-Volatile Memory Information
  __IO uint32_t reserved12[3];		//!< (sysctl:0x1A4)
  __IO uint32_t SYSCTL_LDOPCAL;		//!< (sysctl:0x1B0) LDO Power Calibration
  __IO uint32_t reserved13[1];		//!< (sysctl:0x1B4)
  __IO uint32_t SYSCTL_LDOSPCAL; 	//!< (sysctl:0x1B8) LDO Sleep Power Calibration
  __IO uint32_t SYSCTL_LDODPCTL; 	//!< (sysctl:0x1BC) LDO Deep-Sleep Power Control
  __IO uint32_t SYSCTL_LDODPCAL; 	//!< (sysctl:0x1C0) LDO Deep-Sleep Power Calibration
  __IO uint32_t reserved14[2];		//!< (sysctl:0x1C4)
  __IO uint32_t SYSCTL_SDPMST; 		//!< (sysctl:0x1CC) Sleep / Deep-Sleep Power Mode Status
  __IO uint32_t reserved15[2];		//!< (sysctl:0x1D0)
  __IO uint32_t SYSCTL_RESBEHAVCTL;	//!< (sysctl:0x1D8) Reset Behavior Control Register
  __IO uint32_t reserved16[6];		//!< (sysctl:0x1DC)
  __IO uint32_t SYSCTL_HSSR; 		//!< (sysctl:0x1F4) Hardware System Service Request
  __IO uint32_t reserved17[34];		//!< (sysctl:0x1F8)
  __IO uint32_t SYSCTL_USBPDS; 		//!< (sysctl:0x280) USB Power Domain Status
  __IO uint32_t SYSCTL_USBMPC; 		//!< (sysctl:0x284) USB Memory Power Control
  __IO uint32_t SYSCTL_EMACPDS;		//!< (sysctl:0x288) Ethernet MAC Power Domain Status
  __IO uint32_t SYSCTL_EMACMPC;		//!< (sysctl:0x28C) Ethernet MAC Memory Power Control
  __IO uint32_t reserved18[2];		//!< (sysctl:0x290)
  __IO uint32_t SYSCTL_CAN0PDS;		//!< (sysctl:0x298) CAN 0 Power Domain Status
  __IO uint32_t SYSCTL_CAN0MPC;		//!< (sysctl:0x29C) CAN 0 Memory Power Control
  __IO uint32_t SYSCTL_CAN1PDS;		//!< (sysctl:0x2A0) CAN 1 Power Domain Status
  __IO uint32_t SYSCTL_CAN1MPC;		//!< (sysctl:0x2A4) CAN 1 Memory Power Control
  __IO uint32_t reserved19[22];		//!< (sysctl:0x2A8)

  __IO uint32_t SYSCTL_PPWD; 		//!< (sysctl:0x300) Watchdog Timer Peripheral Present
  __IO uint32_t SYSCTL_PPTIMER;		//!< (sysctl:0x304) 16/32-Bit General-Purpose Timer Peripheral Present
  __IO uint32_t SYSCTL_PPGPIO; 		//!< (sysctl:0x308) General-Purpose Input/Output Peripheral Present
  __IO uint32_t SYSCTL_PPDMA; 		//!< (sysctl:0x30C) Micro Direct Memory Access Peripheral Present
  __IO uint32_t SYSCTL_PPEPI; 		//!< (sysctl:0x310) EPI Peripheral Present
  __IO uint32_t SYSCTL_PPHIB; 		//!< (sysctl:0x314) Hibernation Peripheral Present
  __IO uint32_t SYSCTL_PPUART; 		//!< (sysctl:0x318) Universal Asynchronous Receiver/Transmitter Peripheral Present
  __IO uint32_t SYSCTL_PPSSI; 		//!< (sysctl:0x31C) Synchronous Serial Interface Peripheral Present
  __IO uint32_t SYSCTL_PPI2C; 		//!< (sysctl:0x320) Inter-Integrated Circuit Peripheral Present
  __IO uint32_t reserved20[1];		//!< (sysctl:0x324)
  __IO uint32_t SYSCTL_PPUSB; 		//!< (sysctl:0x328) Universal Serial Bus Peripheral Present
  __IO uint32_t reserved21[1];		//!< (sysctl:0x32C)
  __IO uint32_t SYSCTL_PPEPHY; 		//!< (sysctl:0x330) Ethernet PHY Peripheral Present
  __IO uint32_t SYSCTL_PPCAN; 		//!< (sysctl:0x334) Controller Area Network Peripheral Present
  __IO uint32_t SYSCTL_PPADC; 		//!< (sysctl:0x338) Analog-to-Digital Converter Peripheral Present
  __IO uint32_t SYSCTL_PPACMP; 		//!< (sysctl:0x33C) Analog Comparator Peripheral Present
  __IO uint32_t SYSCTL_PPPWM; 		//!< (sysctl:0x340) Pulse Width Modulator Peripheral Present
  __IO uint32_t SYSCTL_PPQEI; 		//!< (sysctl:0x344) Quadrature Encoder Interface Peripheral Present
  __IO uint32_t SYSCTL_PPLPC; 		//!< (sysctl:0x348) Low Pin Count Interface Peripheral Present
  __IO uint32_t reserved22[1];		//!< (sysctl:0x34C)
  __IO uint32_t SYSCTL_PPPECI; 		//!< (sysctl:0x350) Platform Environment Control Interface Peripheral Present
  __IO uint32_t SYSCTL_PPFAN; 		//!< (sysctl:0x354) Fan Control Peripheral Present
  __IO uint32_t SYSCTL_PPEEPROM; 	//!< (sysctl:0x358) EEPROM Peripheral Present
  __IO uint32_t SYSCTL_PPWTIMER; 	//!< (sysctl:0x35C) 32/64-Bit Wide General-Purpose Timer Peripheral  Present
  __IO uint32_t reserved23[4];		//!< (sysctl:0x360)
  __IO uint32_t SYSCTL_PPRTS; 		//!< (sysctl:0x370) Remote Temperature Sensor Peripheral Present
  __IO uint32_t SYSCTL_PPCCM; 		//!< (sysctl:0x374) CRC and Cryptographic Modules Peripheral Present
  __IO uint32_t reserved24[6];		//!< (sysctl:0x378)
  __IO uint32_t SYSCTL_PPLCD; 		//!< (sysctl:0x390) LCD Peripheral Present
  __IO uint32_t reserved25[1];		//!< (sysctl:0x394)
  __IO uint32_t SYSCTL_PPOWIRE;		//!< (sysctl:0x398) 1-Wire Peripheral Present
  __IO uint32_t SYSCTL_PPEMAC; 		//!< (sysctl:0x39C) Ethernet MAC Peripheral Present
  __IO uint32_t SYSCTL_PPPRB; 		//!< (sysctl:0x3A0) Power Regulator Bus Peripheral Present
  __IO uint32_t SYSCTL_PPHIM; 		//!< (sysctl:0x3A4) Human Interface Master Peripheral Present
  __IO uint32_t reserved26[86];		//!< (sysctl:0x3A8)

  __IO uint32_t SYSCTL_SRWD; 		//!< (sysctl:0x500) Watchdog Timer Software Reset
  __IO uint32_t SYSCTL_SRTIMER;		//!< (sysctl:0x504) 16/32-Bit General-Purpose Timer Software Reset
  __IO uint32_t SYSCTL_SRGPIO; 		//!< (sysctl:0x508) General-Purpose Input/Output Software Reset
  __IO uint32_t SYSCTL_SRDMA; 		//!< (sysctl:0x50C) Micro Direct Memory Access Software Reset
  __IO uint32_t SYSCTL_SREPI; 		//!< (sysctl:0x510) EPI Software Reset
  __IO uint32_t SYSCTL_SRHIB; 		//!< (sysctl:0x514) Hibernation Software Reset
  __IO uint32_t SYSCTL_SRUART; 		//!< (sysctl:0x518) Universal Asynchronous Receiver/Transmitter Software Reset
  __IO uint32_t SYSCTL_SRSSI; 		//!< (sysctl:0x51C) Synchronous Serial Interface Software Reset
  __IO uint32_t SYSCTL_SRI2C; 		//!< (sysctl:0x520) Inter-Integrated Circuit Software Reset
  __IO uint32_t reserved50[1];		//!< (sysctl:0x524)
  __IO uint32_t SYSCTL_SRUSB; 		//!< (sysctl:0x528) Universal Serial Bus Software Reset
  __IO uint32_t reserved51[2];		//!< (sysctl:0x52C)
  __IO uint32_t SYSCTL_SRCAN; 		//!< (sysctl:0x534) Controller Area Network Software Reset
  __IO uint32_t SYSCTL_SRADC; 		//!< (sysctl:0x538) Analog-to-Digital Converter Software Reset
  __IO uint32_t SYSCTL_SRACMP; 		//!< (sysctl:0x53C) Analog Comparator Software Reset
  __IO uint32_t SYSCTL_SRPWM; 		//!< (sysctl:0x540) Pulse Width Modulator Software Reset
  __IO uint32_t SYSCTL_SRQEI; 		//!< (sysctl:0x544) Quadrature Encoder Interface Software Reset
  __IO uint32_t reserved52[4];		//!< (sysctl:0x548)
  __IO uint32_t SYSCTL_SREEPROM; 	//!< (sysctl:0x558) EEPROM Software Reset
  __IO uint32_t reserved53[6];		//!< (sysctl:0x55C)
  __IO uint32_t SYSCTL_SRCCM; 		//!< (sysctl:0x574) CRC and Cryptographic Modules Software Reset
  __IO uint32_t reserved54[9];		//!< (sysctl:0x578)
  __IO uint32_t SYSCTL_SREMAC; 		//!< (sysctl:0x59C) Ethernet MAC Software Reset
  __IO uint32_t reserved55[24];		//!< (sysctl:0x5A0)

