miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
  __IO uint32_t SYSCTL_RCGCWD; 		//!< (sysctl:0x600) Watchdog Timer Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCTIMER; 	//!< (sysctl:0x604) 16/32-Bit General-Purpose Timer Run Mode Clock Gating  Control
  __IO uint32_t SYSCTL_RCGCGPIO; 	//!< (sysctl:0x608) General-Purpose Input/Output Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCDMA; 	//!< (sysctl:0x60C) Micro Direct Memory Access Run Mode Clock Gating  Control
  __IO uint32_t SYSCTL_RCGCEPI; 	//!< (sysctl:0x610) EPI Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCHIB; 	//!< (sysctl:0x614) Hibernation Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCUART; 	//!< (sysctl:0x618) Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCSSI; 	//!< (sysctl:0x61C) Synchronous Serial Interface Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCI2C; 	//!< (sysctl:0x620) Inter-Integrated Circuit Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCUSB; 	//!< (sysctl:0x628) Universal Serial Bus Run Mode Clock Gating Control
  __IO uint32_t reserved60[2];		//!< (sysctl:0x62C)
  __IO uint32_t SYSCTL_RCGCCAN; 	//!< (sysctl:0x634) Controller Area Network Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCADC; 	//!< (sysctl:0x638) Analog-to-Digital Converter Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCACMP; 	//!< (sysctl:0x63C) Analog Comparator Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCPWM; 	//!< (sysctl:0x640) Pulse Width Modulator Run Mode Clock Gating Control
  __IO uint32_t SYSCTL_RCGCQEI; 	//!< (sysctl:0x644) Quadrature Encoder Interface Run Mode Clock Gating Control
  __IO uint32_t reserved61[4];		//!< (sysctl:0x648)
  __IO uint32_t SYSCTL_RCGCEEPROM; 	//!< (sysctl:0x658) EEPROM Run Mode Clock Gating Control
  __IO uint32_t reserved62[6];		//!< (sysctl:0x65C)
  __IO uint32_t SYSCTL_RCGCCCM; 	//!< (sysctl:0x674) CRC and Cryptographic Modules Run Mode Clock Gating Control
  __IO uint32_t reserved63[9];		//!< (sysctl:0x678)
  __IO uint32_t SYSCTL_RCGCEMAC; 	//!< (sysctl:0x69C) Ethernet MAC Run Mode Clock Gating Control
  __IO uint32_t reserved64[24];		//!< (sysctl:0x6A0)

  __IO uint32_t SYSCTL_SCGCWD; 		//!< (sysctl:0x700) Watchdog Timer Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCTIMER; 	//!< (sysctl:0x704) 16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCGPIO; 	//!< (sysctl:0x708) General-Purpose Input/Output Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCDMA; 	//!< (sysctl:0x70C) Micro Direct Memory Access Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCEPI; 	//!< (sysctl:0x710) EPI Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCHIB; 	//!< (sysctl:0x714) Hibernation Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCUART; 	//!< (sysctl:0x718) Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCSSI; 	//!< (sysctl:0x71C) Synchronous Serial Interface Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCI2C; 	//!< (sysctl:0x720) Inter-Integrated Circuit Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCUSB; 	//!< (sysctl:0x728) Universal Serial Bus Sleep Mode Clock Gating Control
  __IO uint32_t reserved70[2];		//!< (sysctl:0x72C)
  __IO uint32_t SYSCTL_SCGCCAN; 	//!< (sysctl:0x734) Controller Area Network Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCADC; 	//!< (sysctl:0x738) Analog-to-Digital Converter Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCACMP; 	//!< (sysctl:0x73C) Analog Comparator Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCPWM; 	//!< (sysctl:0x740) Pulse Width Modulator Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_SCGCQEI; 	//!< (sysctl:0x744) Quadrature Encoder Interface Sleep Mode Clock Gating Control
  __IO uint32_t reserved71[4];		//!< (sysctl:0x748)
  __IO uint32_t SYSCTL_SCGCEEPROM; 	//!< (sysctl:0x758) EEPROM Sleep Mode Clock Gating Control
  __IO uint32_t reserved72[6];		//!< (sysctl:0x75C)
  __IO uint32_t SYSCTL_SCGCCCM; 	//!< (sysctl:0x774) CRC and Cryptographic Modules Sleep Mode Clock Gating Control
  __IO uint32_t reserved73[9];		//!< (sysctl:0x778)
  __IO uint32_t SYSCTL_SCGCEMAC; 	//!< (sysctl:0x79C) Ethernet MAC Sleep Mode Clock Gating Control
  __IO uint32_t reserved74[24];		//!< (sysctl:0x7A0)

  __IO uint32_t SYSCTL_DCGCWD; 		//!< (sysctl:0x800) Watchdog Timer Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCTIMER; 	//!< (sysctl:0x804) 16/32-Bit General-Purpose Timer Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCGPIO; 	//!< (sysctl:0x808) General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCDMA; 	//!< (sysctl:0x80C) Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCEPI; 	//!< (sysctl:0x810) EPI Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCHIB; 	//!< (sysctl:0x814) Hibernation Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCUART; 	//!< (sysctl:0x818) Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCSSI; 	//!< (sysctl:0x81C) Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCI2C; 	//!< (sysctl:0x820) Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCUSB; 	//!< (sysctl:0x828) Universal Serial Bus Deep-Sleep Mode Clock Gating Control
  __IO uint32_t reserved80[2];		//!< (sysctl:0x82C)
  __IO uint32_t SYSCTL_DCGCCAN; 	//!< (sysctl:0x834) Controller Area Network Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCADC; 	//!< (sysctl:0x838) Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCACMP; 	//!< (sysctl:0x83C) Analog Comparator Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCPWM; 	//!< (sysctl:0x840) Pulse Width Modulator Deep-Sleep Mode Clock Gating Control
  __IO uint32_t SYSCTL_DCGCQEI; 	//!< (sysctl:0x844) Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control
  __IO uint32_t reserved81[4];		//!< (sysctl:0x848)
  __IO uint32_t SYSCTL_DCGCEEPROM; 	//!< (sysctl:0x858) EEPROM Deep-Sleep Mode Clock Gating Control
  __IO uint32_t reserved82[6];		//!< (sysctl:0x85C)
  __IO uint32_t SYSCTL_DCGCCCM; 	//!< (sysctl:0x874) CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control
  __IO uint32_t reserved83[9];		//!< (sysctl:0x878)
  __IO uint32_t SYSCTL_DCGCEMAC; 	//!< (sysctl:0x89C) Ethernet MAC Deep-Sleep Mode Clock Gating Control
  __IO uint32_t reserved84[24];		//!< (sysctl:0x8A0)

  __IO uint32_t SYSCTL_PCWD; 		//!< (sysctl:0x900) Watchdog Timer Power Control
  __IO uint32_t SYSCTL_PCTIMER; 	//!< (sysctl:0x904) 16/32-Bit General-Purpose Timer Power Control
  __IO uint32_t SYSCTL_PCGPIO; 		//!< (sysctl:0x908) General-Purpose Input/Output Power Control
  __IO uint32_t SYSCTL_PCDMA; 		//!< (sysctl:0x90C) Micro Direct Memory Access Power Control
  __IO uint32_t SYSCTL_PCEPI; 		//!< (sysctl:0x910) External Peripheral Interface Power Control
  __IO uint32_t SYSCTL_PCHIB; 		//!< (sysctl:0x914) Hibernation Power Control
  __IO uint32_t SYSCTL_PCUART; 		//!< (sysctl:0x918) Universal Asynchronous Receiver/Transmitter Power Control
  __IO uint32_t SYSCTL_PCSSI; 		//!< (sysctl:0x91C) Synchronous Serial Interface Power Control
  __IO uint32_t SYSCTL_PCI2C; 		//!< (sysctl:0x920) Inter-Integrated Circuit Power Control
  __IO uint32_t SYSCTL_PCUSB; 		//!< (sysctl:0x928) Universal Serial Bus Power Control
  __IO uint32_t reserved90[2];		//!< (sysctl:0x92C)
  __IO uint32_t SYSCTL_PCCAN; 		//!< (sysctl:0x934) Controller Area Network Power Control
  __IO uint32_t SYSCTL_PCADC; 		//!< (sysctl:0x938) Analog-to-Digital Converter Power Control
  __IO uint32_t SYSCTL_PCACMP; 		//!< (sysctl:0x93C) Analog Comparator Power Control
  __IO uint32_t SYSCTL_PCPWM; 		//!< (sysctl:0x940) Pulse Width Modulator Power Control
  __IO uint32_t SYSCTL_PCQEI; 		//!< (sysctl:0x944) Quadrature Encoder Interface Power Control
  __IO uint32_t reserved91[4];		//!< (sysctl:0x948)
  __IO uint32_t SYSCTL_PCEEPROM; 	//!< (sysctl:0x958) EEPROM Power Control
  __IO uint32_t reserved92[6];		//!< (sysctl:0x95C)
  __IO uint32_t SYSCTL_PCCCM; 		//!< (sysctl:0x974) CRC and Cryptographic Modules Power Control
  __IO uint32_t reserved93[9];		//!< (sysctl:0x978)
  __IO uint32_t SYSCTL_PCEMAC; 		//!< (sysctl:0x99C) Ethernet MAC Power Control
  __IO uint32_t reserved94[24];		//!< (sysctl:0x9A0)

  __IO uint32_t SYSCTL_PRWD; 		//!< (sysctl:0xA00) Watchdog Timer Peripheral Ready
  __IO uint32_t SYSCTL_PRTIMER; 	//!< (sysctl:0xA04) 16/32-Bit General-Purpose Timer Peripheral Ready
  __IO uint32_t SYSCTL_PRGPIO; 		//!< (sysctl:0xA08) General-Purpose Input/Output Peripheral Ready
  __IO uint32_t SYSCTL_PRDMA; 		//!< (sysctl:0xA0C) Micro Direct Memory Access Peripheral Ready
  __IO uint32_t SYSCTL_PREPI; 		//!< (sysctl:0xA10) EPI Peripheral Ready
  __IO uint32_t SYSCTL_PRHIB; 		//!< (sysctl:0xA14) Hibernation Peripheral Ready
  __IO uint32_t SYSCTL_PRUART; 		//!< (sysctl:0xA18) Universal Asynchronous Receiver/Transmitter Peripheral Ready
  __IO uint32_t SYSCTL_PRSSI; 		//!< (sysctl:0xA1C) Synchronous Serial Interface Peripheral Ready
  __IO uint32_t SYSCTL_PRI2C; 		//!< (sysctl:0xA20) Inter-Integrated Circuit Peripheral Ready
  __IO uint32_t SYSCTL_PRUSB; 		//!< (sysctl:0xA28) Universal Serial Bus Peripheral Ready
  __IO uint32_t reservedA0[2];		//!< (sysctl:0xA2C)
  __IO uint32_t SYSCTL_PRCAN; 		//!< (sysctl:0xA34) Controller Area Network Peripheral Ready
  __IO uint32_t SYSCTL_PRADC; 		//!< (sysctl:0xA38) Analog-to-Digital Converter Peripheral Ready
  __IO uint32_t SYSCTL_PRACMP; 		//!< (sysctl:0xA3C) Analog Comparator Peripheral Ready
  __IO uint32_t SYSCTL_PRPWM; 		//!< (sysctl:0xA40) Pulse Width Modulator Peripheral Ready
  __IO uint32_t SYSCTL_PRQEI; 		//!< (sysctl:0xA44) Quadrature Encoder Interface Peripheral Ready
  __IO uint32_t reservedA1[4];		//!< (sysctl:0xA48)
  __IO uint32_t SYSCTL_PREEPROM; 	//!< (sysctl:0xA58) EEPROM Peripheral Ready
  __IO uint32_t reservedA2[6];		//!< (sysctl:0xA5C)
  __IO uint32_t SYSCTL_PRCCM; 		//!< (sysctl:0xA74) CRC and Cryptographic Modules Peripheral Ready
  __IO uint32_t reservedA3[9];		//!< (sysctl:0xA78)
  __IO uint32_t SYSCTL_PREMAC; 		//!< (sysctl:0xA9C) Ethernet MAC Peripheral Ready
};

