miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
/*******************************************************************************
 * @defgroup SYSCTL_regs_define
 * @{
 ******************************************************************************/

/** @defgroup SYSCTL_DID0:		(sysctl:0x000) Device Identification 0          */
#define SYSCTL_DID0_VER					0x70000000 		//!< DID0 Version
/** @} */

/** @defgroup SYSCTL_DID1: 		(sysctl:0x004) RO - Device Identification 1     */
/** @} */

/** @defgroup SYSCTL_PTBOCTL: 	(sysctl:0x038) Power-Temp Brown Out Control     */
/** @} */

/** @defgroup SYSCTL_RIS: 		(sysctl:0x050) Raw Interrupt Status             */
#define SYSCTL_RIS_MOSCPUPRIS			0x00000100 		//!< MOSC Power Up Raw Interrupt Status
#define SYSCTL_RIS_PLLLRIS				0x00000040 		//!< PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_MOFRIS				0x00000008 		//!< Main Oscillator Failure Raw Interrupt Status
#define SYSCTL_RIS_BORRIS				0x00000002 		//!< Brown-Out Reset Raw Interrupt Status
/** @} */

/** @defgroup SYSCTL_IMC: 		(sysctl:0x054) Interrupt Mask Control           */
/** @} */

/** @defgroup SYSCTL_MISC:		(sysctl:0x058) Masked Interrupt Status and Clear*/
#define SYSCTL_MISC_MOSCPUPMIS			0x00000100 		//!< MOSC Power Up Masked Interrupt Status
#define SYSCTL_MISC_PLLLMIS				0x00000040 		//!< PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_MOFMIS				0x00000008 		//!< Main Oscillator Failure Masked Interrupt Status
#define SYSCTL_MISC_BORMIS				0x00000002 		//!< BOR Masked Interrupt Status
/** @} */

/** @defgroup SYSCTL_RESC:		(sysctl:0x05C) Reset Cause                      */
/** @} */

/** @defgroup SYSCTL_PWRTC:		(sysctl:0x060) Power-Temperature Cause          */
/** @} */

/** @defgroup SYSCTL_NMIC:		(sysctl:0x064) NMI Cause Register               */
/** @} */

/** @defgroup SYSCTL_MOSCCTL:	(sysctl:0x07C) Main Oscillator Control          */
#define SYSCTL_MOSCCTL_OSCRNG			0x00000010 		//!< Oscillator Range
#define SYSCTL_MOSCCTL_PWRDN			0x00000008 		//!< Power Down
#define SYSCTL_MOSCCTL_NOXTAL			0x00000004 		//!< No MOSC/Crystal Connected
#define SYSCTL_MOSCCTL_MOSCIM			0x00000002 		//!< MOSC Failure Action
#define SYSCTL_MOSCCTL_CVAL				0x00000001 		//!< Clock Validation for MOSC
/** @} */

/** @defgroup SYSCTL_RSCLKCFG: 	(sysctl:0x0B0) Run and Sleep Mode Configuration Register */
#define SYSCTL_RSCLKCFG_MEMTIMU			0x80000000 		//!< Memory Timing Register Update
#define SYSCTL_RSCLKCFG_NEWFREQ			0x40000000 		//!< New PLLFREQ Accept
#define SYSCTL_RSCLKCFG_ACG				0x20000000 		//!< Auto Clock Gating
#define SYSCTL_RSCLKCFG_USEPLL			0x10000000 		//!< Use PLL
#define SYSCTL_RSCLKCFG_PLLSRC			0x0F000000 		//!< PLL Source
#define SYSCTL_RSCLKCFG_PLLSRC_PIOSC	0x00000000 		//!<  PIOSC is the PLL input clock source
#define SYSCTL_RSCLKCFG_PLLSRC_MOSC		0x03000000 		//!<  MOSC is the PLL input clock source
#define SYSCTL_RSCLKCFG_OSCSRC			0x00F00000 		//!< Oscillator Source
#define SYSCTL_RSCLKCFG_OSCSRC_PIOSC	0x00000000 		//!<  PIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_LFIOSC	0x00200000 		//!<  LFIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_MOSC		0x00300000 		//!<  MOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_RTCOSC	0x00400000 		//!<  Hibernation Module RTC Oscillator (RTCOSC)
#define SYSCTL_RSCLKCFG_OSYSDIV			0x000FFC00 		//!< Oscillator System Clock Divisor
#define SYSCTL_RSCLKCFG_PSYSDIV			0x000003FF 		//!< PLL System Clock Divisor
#define SYSCTL_RSCLKCFG_PSYSDIV_Set(x)	(x) 			//!<  set macro
/** @} */

/** @defgroup SYSCTL_MEMTIM0:	(sysctl:0x0C0) Memory Timing Parameter Register 0 for Main Flash and  EEPROM */
#define SYSCTL_MEMTIM0_EBCHT			0x03C00000 		//!< EEPROM Clock High Time
#define SYSCTL_MEMTIM0_EBCHT_0_5		0x00000000 		//!<  1/2 system clock period
#define SYSCTL_MEMTIM0_EBCHT_1_0		0x00400000 		//!<  1 system clock period
#define SYSCTL_MEMTIM0_EBCHT_1_5		0x00800000 		//!<  1.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2_0		0x00C00000 		//!<  2 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2_5		0x01000000 		//!<  2.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3_0		0x01400000 		//!<  3 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3_5		0x01800000 		//!<  3.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_4_0		0x01C00000 		//!<  4 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_4_5		0x02000000 		//!<  4.5 system clock periods
#define SYSCTL_MEMTIM0_EBCE				0x00200000 		//!< EEPROM Bank Clock Edge
#define SYSCTL_MEMTIM0_MB1      		0x00100010  	//!< Must be one
#define SYSCTL_MEMTIM0_EWS				0x000F0000 		//!< EEPROM Wait States
#define SYSCTL_MEMTIM0_EWS_0			0x00000000 		//!<  0 wait states
#define SYSCTL_MEMTIM0_EWS_1			0x00010000 		//!<  1 wait states
#define SYSCTL_MEMTIM0_EWS_2			0x00020000 		//!<  2 wait states
#define SYSCTL_MEMTIM0_EWS_3			0x00030000 		//!<  3 wait states
#define SYSCTL_MEMTIM0_EWS_4			0x00040000 		//!<  4 wait states
#define SYSCTL_MEMTIM0_EWS_5			0x00050000 		//!<  5 wait states
#define SYSCTL_MEMTIM0_EWS_6			0x00060000 		//!<  6 wait states
#define SYSCTL_MEMTIM0_EWS_7			0x00070000 		//!<  7 wait states
#define SYSCTL_MEMTIM0_FBCHT			0x000003C0 		//!< Flash Bank Clock High Time
#define SYSCTL_MEMTIM0_FBCHT_0_5		0x00000000 		//!<  1/2 system clock period
#define SYSCTL_MEMTIM0_FBCHT_1_0		0x00000040 		//!<  1 system clock period
#define SYSCTL_MEMTIM0_FBCHT_1_5		0x00000080 		//!<  1.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2_0		0x000000C0 		//!<  2 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2_5		0x00000100 		//!<  2.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3_0		0x00000140 		//!<  3 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3_5		0x00000180 		//!<  3.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_4_0		0x000001C0 		//!<  4 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_4_5		0x00000200 		//!<  4.5 system clock periods
#define SYSCTL_MEMTIM0_FBCE				0x00000020 		//!< EEPROM Bank Clock Edge
#define SYSCTL_MEMTIM0_FWS				0x0000000F 		//!< Flash Wait State
#define SYSCTL_MEMTIM0_FWS_0			0x00000000 		//!<  0 wait states
#define SYSCTL_MEMTIM0_FWS_1			0x00000001 		//!<  1 wait states
#define SYSCTL_MEMTIM0_FWS_2			0x00000002 		//!<  2 wait states
#define SYSCTL_MEMTIM0_FWS_3			0x00000003 		//!<  3 wait states
#define SYSCTL_MEMTIM0_FWS_4			0x00000004 		//!<  4 wait states
#define SYSCTL_MEMTIM0_FWS_5			0x00000005 		//!<  5 wait states
#define SYSCTL_MEMTIM0_FWS_6			0x00000006 		//!<  6 wait states
#define SYSCTL_MEMTIM0_FWS_7			0x00000007 		//!<  7 wait states
/** @} */

/** @defgroup SYSCTL_DSMEMTIM0:	(sysctl:0x0C8) Deep Sleep Mode Memory Timing Register 0 for Main Flash and EEPROM */
/** @} */

