miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
/** @defgroup SYSCTL_ALTCLKCFG: (sysctl:0x138) Alternate Clock Configuration	*/
/** @} */

/** @defgroup SYSCTL_DSCLKCFG: 	(sysctl:0x144) Deep Sleep Clock Configuration Register */
/** @} */

/** @defgroup SYSCTL_DIVSCLK:	(sysctl:0x148) Divisor and Source Clock Configuration */
/** @} */

/** @defgroup SYSCTL_SYSPROP:	(sysctl:0x14C) System Properties				*/
/** @} */

/** @defgroup SYSCTL_PIOSCCAL:	(sysctl:0x150) Precision Internal Oscillator Calibration */
/** @} */

/** @defgroup SYSCTL_PIOSCSTAT:	(sysctl:0x154) Precision Internal Oscillator Statistics*/
/** @} */

/** @defgroup SYSCTL_PLLFREQ0:	(sysctl:0x160) PLL Frequency 0					*/
#define SYSCTL_PLLFREQ0_PLLPWR			0x00800000 		//!< PLL Power
#define SYSCTL_PLLFREQ0_MFRAC			0x000FFC00 		//!< PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MFRAC_Set(x)	((x)<<10)		//!<  set macro
#define SYSCTL_PLLFREQ0_MINT			0x000003FF 		//!< PLL M Integer Value
#define SYSCTL_PLLFREQ0_MINT_Set(x)		(x) 			//!<  set macro
/** @} */

/** @defgroup SYSCTL_PLLFREQ1:	(sysctl:0x164) PLL Frequency 1                  */
#define SYSCTL_PLLFREQ1_Q				0x00001F00 		//!< PLL Q Value
#define SYSCTL_PLLFREQ1_Q_Set(x)		((x)<<8) 		//!<  set macro
#define SYSCTL_PLLFREQ1_N				0x0000001F 		//!< PLL N Value
#define SYSCTL_PLLFREQ1_N_Set(x)		((x)-1)	 		//!<  set macro
/** @} */

/** @defgroup SYSCTL_PLLSTAT:	(sysctl:0x168) PLL Status                       */
#define SYSCTL_PLLSTAT_LOCK				0x00000001 		//!< PLL Lock
/** @} */

/** @defgroup SYSCTL_SLPPWRCFG:	(sysctl:0x188) Sleep Power Configuration        */
/** @} */

/** @defgroup SYSCTL_DSLPPWRCFG:(sysctl:0x18C) Deep-Sleep Power Configuration   */
/** @} */

/** @defgroup SYSCTL_NVMSTAT:	(sysctl:0x1A0) Non-Volatile Memory Information  */
/** @} */

/** @defgroup SYSCTL_LDOPCAL:	(sysctl:0x1B0) LDO Power Calibration            */
/** @} */

/** @defgroup SYSCTL_LDOSPCAL: 	(sysctl:0x1B8) LDO Sleep Power Calibration      */
/** @} */

/** @defgroup SYSCTL_LDODPCTL: 	(sysctl:0x1BC) LDO Deep-Sleep Power Control     */
/** @} */

/** @defgroup SYSCTL_LDODPCAL: 	(sysctl:0x1C0) LDO Deep-Sleep Power Calibration */
/** @} */

/** @defgroup SYSCTL_SDPMST: 	(sysctl:0x1CC) Sleep / Deep-Sleep Power Mode Status */
/** @} */

/** @defgroup SYSCTL_RESBEHAVCTL:(sysctl:0x1D8) Reset Behavior Control Register */
/** @} */

/** @defgroup SYSCTL_HSSR: 		(sysctl:0x1F4) Hardware System Service Request  */
/** @} */

/** @defgroup SYSCTL_USBPDS: 	(sysctl:0x280) USB Power Domain Status          */
/** @} */

/** @defgroup SYSCTL_USBMPC: 	(sysctl:0x284) USB Memory Power Control         */
/** @} */

/** @defgroup SYSCTL_EMACPDS:	(sysctl:0x288) Ethernet MAC Power Domain Status */
/** @} */

/** @defgroup SYSCTL_EMACMPC:	(sysctl:0x28C) Ethernet MAC Memory Power Control*/
/** @} */

/** @defgroup SYSCTL_CAN0PDS:	(sysctl:0x298) CAN 0 Power Domain Status        */
/** @} */

/** @defgroup SYSCTL_CAN0MPC:	(sysctl:0x29C) CAN 0 Memory Power Control       */
/** @} */

/** @defgroup SYSCTL_CAN1PDS:	(sysctl:0x2A0) CAN 1 Power Domain Status        */
/** @} */

/** @defgroup SYSCTL_CAN1MPC:	(sysctl:0x2A4) CAN 1 Memory Power Control       */
/** @} */

/** @defgroup SYSCTL_PPWD: 		(sysctl:0x300) Watchdog Timer Peripheral Present*/
/** @} */

/** @defgroup SYSCTL_PPTIMER:	(sysctl:0x304) 16/32-Bit General-Purpose Timer Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPGPIO: 	(sysctl:0x308) General-Purpose Input/Output Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPDMA: 	(sysctl:0x30C) Micro Direct Memory Access Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPEPI: 	(sysctl:0x310) EPI Peripheral Present			*/
/** @} */

/** @defgroup SYSCTL_PPHIB: 	(sysctl:0x314) Hibernation Peripheral Present   */
/** @} */

/** @defgroup SYSCTL_PPUART: 	(sysctl:0x318) Universal Asynchronous Receiver/Transmitter Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPSSI: 	(sysctl:0x31C) Synchronous Serial Interface Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPI2C: 	(sysctl:0x320) Inter-Integrated Circuit Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPUSB: 	(sysctl:0x328) Universal Serial Bus Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPEPHY: 	(sysctl:0x330) Ethernet PHY Peripheral Present	*/
/** @} */

/** @defgroup SYSCTL_PPCAN: 	(sysctl:0x334) Controller Area Network Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPADC: 	(sysctl:0x338) Analog-to-Digital Converter Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPACMP: 	(sysctl:0x33C) Analog Comparator Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPPWM: 	(sysctl:0x340) Pulse Width Modulator Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPQEI: 	(sysctl:0x344) Quadrature Encoder Interface Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPLPC: 	(sysctl:0x348) Low Pin Count Interface Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPPECI: 	(sysctl:0x350) Platform Environment Control Interface Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPFAN: 	(sysctl:0x354) Fan Control Peripheral Present	*/
/** @} */

/** @defgroup SYSCTL_PPEEPROM: 	(sysctl:0x358) EEPROM Peripheral Present        */
/** @} */

/** @defgroup SYSCTL_PPWTIMER: 	(sysctl:0x35C) 32/64-Bit Wide General-Purpose Timer Peripheral  Present */
/** @} */

/** @defgroup SYSCTL_PPRTS: 	(sysctl:0x370) Remote Temperature Sensor Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPCCM: 	(sysctl:0x374) CRC and Cryptographic Modules Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPLCD: 	(sysctl:0x390) LCD Peripheral Present			*/
/** @} */

/** @defgroup SYSCTL_PPOWIRE:	(sysctl:0x398) 1-Wire Peripheral Present        */
/** @} */

/** @defgroup SYSCTL_PPEMAC: 	(sysctl:0x39C) Ethernet MAC Peripheral Present  */
/** @} */

/** @defgroup SYSCTL_PPPRB: 	(sysctl:0x3A0) Power Regulator Bus Peripheral Present */
/** @} */

/** @defgroup SYSCTL_PPHIM: 	(sysctl:0x3A4) Human Interface Master Peripheral Present */
/** @} */

/** @defgroup SYSCTL_SRWD: 		(sysctl:0x500) Watchdog Timer Software Reset	*/
/** @} */

