miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
/** @defgroup SYSCTL_SRTIMER:	(sysctl:0x504) 16/32-Bit General-Purpose Timer Software Reset */
/** @} */

/** @defgroup SYSCTL_SRGPIO: 	(sysctl:0x508) General-Purpose Input/Output Software Reset */
/** @} */

/** @defgroup SYSCTL_SRDMA: 	(sysctl:0x50C) Micro Direct Memory Access Software Reset */
/** @} */

/** @defgroup SYSCTL_SREPI: 	(sysctl:0x510) EPI Software Reset				*/
/** @} */

/** @defgroup SYSCTL_SRHIB: 	(sysctl:0x514) Hibernation Software Reset       */
/** @} */

/** @defgroup SYSCTL_SRUART: 	(sysctl:0x518) Universal Asynchronous Receiver/Transmitter Software Reset */
/** @} */

/** @defgroup SYSCTL_SRSSI: 	(sysctl:0x51C) Synchronous Serial Interface Software Reset */
/** @} */

/** @defgroup SYSCTL_SRI2C: 	(sysctl:0x520) Inter-Integrated Circuit Software Reset */
/** @} */

/** @defgroup SYSCTL_SRUSB: 	(sysctl:0x528) Universal Serial Bus Software Reset */
/** @} */

/** @defgroup SYSCTL_SRCAN: 	(sysctl:0x534) Controller Area Network Software Reset */
/** @} */

/** @defgroup SYSCTL_SRADC: 	(sysctl:0x538) Analog-to-Digital Converter Software Reset */
/** @} */

/** @defgroup SYSCTL_SRACMP: 	(sysctl:0x53C) Analog Comparator Software Reset */
/** @} */

/** @defgroup SYSCTL_SRPWM: 	(sysctl:0x540) Pulse Width Modulator Software Reset */
/** @} */

/** @defgroup SYSCTL_SRQEI: 	(sysctl:0x544) Quadrature Encoder Interface Software Reset */
/** @} */

/** @defgroup SYSCTL_SREEPROM: 	(sysctl:0x558) EEPROM Software Reset 			*/
/** @} */

/** @defgroup SYSCTL_SRCCM: 	(sysctl:0x574) CRC and Cryptographic Modules Software Reset */
/** @} */

/** @defgroup SYSCTL_SREMAC: 	(sysctl:0x59C) Ethernet MAC Software Reset		*/
/** @} */

/** @defgroup SYSCTL_RCGCWD: 	(sysctl:0x600) Watchdog Timer Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCTIMER: (sysctl:0x604) 16/32-Bit General-Purpose Timer Run Mode Clock Gating  Control */
/** @} */

/** @defgroup SYSCTL_RCGCGPIO: 	(sysctl:0x608) General-Purpose Input/Output Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCDMA: 	(sysctl:0x60C) Micro Direct Memory Access Run Mode Clock Gating  Control */
/** @} */

/** @defgroup SYSCTL_RCGCEPI: 	(sysctl:0x610) EPI Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCHIB: 	(sysctl:0x614) Hibernation Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCUART: 	(sysctl:0x618) Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCSSI: 	(sysctl:0x61C) Synchronous Serial Interface Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCI2C: 	(sysctl:0x620) Inter-Integrated Circuit Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCUSB: 	(sysctl:0x628) Universal Serial Bus Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCCAN: 	(sysctl:0x634) Controller Area Network Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCADC: 	(sysctl:0x638) Analog-to-Digital Converter Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCACMP: 	(sysctl:0x63C) Analog Comparator Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCPWM: 	(sysctl:0x640) Pulse Width Modulator Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCQEI: 	(sysctl:0x644) Quadrature Encoder Interface Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCEEPROM:(sysctl:0x658) EEPROM Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCCCM: 	(sysctl:0x674) CRC and Cryptographic Modules Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_RCGCEMAC: 	(sysctl:0x69C) Ethernet MAC Run Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCWD: 	(sysctl:0x700) Watchdog Timer Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCTIMER: (sysctl:0x704) 16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCGPIO: 	(sysctl:0x708) General-Purpose Input/Output Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCDMA: 	(sysctl:0x70C) Micro Direct Memory Access Sleep Mode Clock Gating Control*/
/** @} */

/** @defgroup SYSCTL_SCGCEPI: 	(sysctl:0x710) EPI Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCHIB: 	(sysctl:0x714) Hibernation Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCUART: 	(sysctl:0x718) Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCSSI: 	(sysctl:0x71C) Synchronous Serial Interface Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCI2C: 	(sysctl:0x720) Inter-Integrated Circuit Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCUSB: 	(sysctl:0x728) Universal Serial Bus Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCCAN: 	(sysctl:0x734) Controller Area Network Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCADC: 	(sysctl:0x738) Analog-to-Digital Converter Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCACMP: 	(sysctl:0x73C) Analog Comparator Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCPWM: 	(sysctl:0x740) Pulse Width Modulator Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCQEI: 	(sysctl:0x744) Quadrature Encoder Interface Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCEEPROM:(sysctl:0x758) EEPROM Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCCCM: 	(sysctl:0x774) CRC and Cryptographic Modules Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_SCGCEMAC: 	(sysctl:0x79C) Ethernet MAC Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCWD: 	(sysctl:0x800) Watchdog Timer Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCTIMER: (sysctl:0x804) 16/32-Bit General-Purpose Timer Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCGPIO: 	(sysctl:0x808) General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCDMA: 	(sysctl:0x80C) Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control */
/** @} */

