miro-kostadinov/tmos/tags/tmos/4.11.0.0/hardware/tm4c/sysctl_tm4c.h
/** @defgroup SYSCTL_DCGCEPI: 	(sysctl:0x810) EPI Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCHIB: 	(sysctl:0x814) Hibernation Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCUART: 	(sysctl:0x818) Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCSSI: 	(sysctl:0x81C) Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCI2C: 	(sysctl:0x820) Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCUSB: 	(sysctl:0x828) Universal Serial Bus Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCCAN: 	(sysctl:0x834) Controller Area Network Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCADC: 	(sysctl:0x838) Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCACMP: 	(sysctl:0x83C) Analog Comparator Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCPWM: 	(sysctl:0x840) Pulse Width Modulator Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCQEI: 	(sysctl:0x844) Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCEEPROM:(sysctl:0x858) EEPROM Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCCCM: 	(sysctl:0x874) CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control */
/** @} */

/** @defgroup SYSCTL_DCGCEMAC: 	(sysctl:0x89C) Ethernet MAC Deep-Sleep Mode Clock Gating Control  */
/** @} */

/** @defgroup SYSCTL_PCWD: 		(sysctl:0x900) Watchdog Timer Power Control		 */
/** @} */

/** @defgroup SYSCTL_PCTIMER: 	(sysctl:0x904) 16/32-Bit General-Purpose Timer Power Control  */
/** @} */

/** @defgroup SYSCTL_PCGPIO: 	(sysctl:0x908) General-Purpose Input/Output Power Control */
/** @} */

/** @defgroup SYSCTL_PCDMA: 	(sysctl:0x90C) Micro Direct Memory Access Power Control */
/** @} */

/** @defgroup SYSCTL_PCEPI: 	(sysctl:0x910) External Peripheral Interface Power Control */
/** @} */

/** @defgroup SYSCTL_PCHIB: 	(sysctl:0x914) Hibernation Power Control */
/** @} */

/** @defgroup SYSCTL_PCUART: 	(sysctl:0x918) Universal Asynchronous Receiver/Transmitter Power Control */
/** @} */

/** @defgroup SYSCTL_PCSSI: 	(sysctl:0x91C) Synchronous Serial Interface Power Control */
/** @} */

/** @defgroup SYSCTL_PCI2C: 	(sysctl:0x920) Inter-Integrated Circuit Power Control */
/** @} */

/** @defgroup SYSCTL_PCUSB: 	(sysctl:0x928) Universal Serial Bus Power Control */
/** @} */

/** @defgroup SYSCTL_PCCAN: 	(sysctl:0x934) Controller Area Network Power Control */
/** @} */

/** @defgroup SYSCTL_PCADC: 	(sysctl:0x938) Analog-to-Digital Converter Power Control */
/** @} */

/** @defgroup SYSCTL_PCACMP: 	(sysctl:0x93C) Analog Comparator Power Control */
/** @} */

/** @defgroup SYSCTL_PCPWM: 	(sysctl:0x940) Pulse Width Modulator Power Control */
/** @} */

/** @defgroup SYSCTL_PCQEI: 	(sysctl:0x944) Quadrature Encoder Interface Power Control */
/** @} */

/** @defgroup SYSCTL_PCEEPROM: 	(sysctl:0x958) EEPROM Power Control			 */
/** @} */

/** @defgroup SYSCTL_PCCCM: 	(sysctl:0x974) CRC and Cryptographic Modules Power Control */
/** @} */

/** @defgroup SYSCTL_PCEMAC: 	(sysctl:0x99C) Ethernet MAC Power Control	 */
/** @} */

/** @defgroup SYSCTL_PRWD: 		(sysctl:0xA00) Watchdog Timer Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRTIMER: 	(sysctl:0xA04) 16/32-Bit General-Purpose Timer Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRGPIO: 	(sysctl:0xA08) General-Purpose Input/Output Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRDMA: 	(sysctl:0xA0C) Micro Direct Memory Access Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PREPI: 	(sysctl:0xA10) EPI Peripheral Ready				 */
/** @} */

/** @defgroup SYSCTL_PRHIB: 	(sysctl:0xA14) Hibernation Peripheral Ready		 */
/** @} */

/** @defgroup SYSCTL_PRUART: 	(sysctl:0xA18) Universal Asynchronous Receiver/Transmitter Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRSSI: 	(sysctl:0xA1C) Synchronous Serial Interface Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRI2C: 	(sysctl:0xA20) Inter-Integrated Circuit Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRUSB: 	(sysctl:0xA28) Universal Serial Bus Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRCAN: 	(sysctl:0xA34) Controller Area Network Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRADC: 	(sysctl:0xA38) Analog-to-Digital Converter Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRACMP: 	(sysctl:0xA3C) Analog Comparator Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRPWM: 	(sysctl:0xA40) Pulse Width Modulator Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PRQEI: 	(sysctl:0xA44) Quadrature Encoder Interface Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PREEPROM: 	(sysctl:0xA58) EEPROM Peripheral Ready			 */
/** @} */

/** @defgroup SYSCTL_PRCCM: 	(sysctl:0xA74) CRC and Cryptographic Modules Peripheral Ready */
/** @} */

/** @defgroup SYSCTL_PREMAC: 	(sysctl:0xA9C) Ethernet MAC Peripheral Ready	 */
/** @} */


/** @} */ // @defgroup SYSCTL_regs_define


struct TM4C_CLOCK_CFG
{
	uint32_t CFG_clk_freq;
	uint32_t CFG_xtal_freq;
	uint32_t CFG_RSCLKCFG;
	uint32_t CFG_PLLFREQ0;
	uint32_t CFG_PLLFREQ1;
};

void SysCtlClockSet(const TM4C_CLOCK_CFG* cfg);
void SysCtlPeripheralReset(uint32_t ulPeripheral);
void SysCtlPeripheralEnable(uint32_t ulPeripheral);
void SysCtlPeripheralDisable(uint32_t ulPeripheral);

#endif /* SYSCTL_TM4C_H_ */
